In [1]:
import pandas as pd

In [2]:
data = {"Name" : ["John", "Peter", "Lisa"],
        "Age" : [25, 28, 31],
        "Salary" : [30000, 45000, 25000]}

df = pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   John   25   30000
1  Peter   28   45000
2   Lisa   31   25000

In [22]:
data = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/customers.csv")
print(data.head(10))
print(data.tail())

         id                name      segment           state             city
0  CG-12520         Claire Gute     Consumer        Kentucky        Henderson
1  DV-13045     Darrin Van Huff    Corporate      California      Los Angeles
2  SO-20335      Sean O'Donnell     Consumer         Florida  Fort Lauderdale
3  BH-11710     Brosina Hoffman     Consumer      California      Los Angeles
4  AA-10480        Andrew Allen     Consumer  North Carolina          Concord
5  IM-15070        Irene Maddox     Consumer      Washington          Seattle
6  HP-14815       Harold Pawlan  Home Office           Texas       Fort Worth
7  PK-19075           Pete Kriz     Consumer       Wisconsin          Madison
8  AG-10270     Alejandro Grove     Consumer            Utah      West Jordan
9  ZD-21925  Zuschuss Donatelli     Consumer      California    San Francisco
           id               name      segment         state               city
788  CJ-11875       Carl Jackson    Corporate  Pennsylvania       Philadelphia
789  RS-19870         Roy Skaria  Home Office          Iowa         Burlington
790  SC-20845         Sung Chung     Consumer      Illinois  Arlington Heights
791  RE-19405    Ricardo Emerson     Consumer          Ohio               Kent
792  SM-20905  Susan MacKendrick     Consumer          Ohio             Newark

In [7]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 793 entries, 0 to 792
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       793 non-null    object
 1   name     793 non-null    object
 2   segment  793 non-null    object
 3   state    793 non-null    object
 4   city     793 non-null    object
dtypes: object(5)
memory usage: 31.1+ KB
None

In [11]:
print(data.describe())

              id         name   segment       state           city
count        793          793       793         793            793
unique       793          793         3          41            252
top     CG-12520  Claire Gute  Consumer  California  New York City
freq           1            1       409         161             68

In [10]:
print(data.isnull().sum())

id         0
name       0
segment    0
state      0
city       0
dtype: int64

In [12]:
df = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/WA_Fn-UseC_-HR-Employee-Attrition.csv")
print(df.head())

   Age Attrition     BusinessTravel  DailyRate              Department  \
0   41       Yes      Travel_Rarely       1102                   Sales
1   49        No  Travel_Frequently        279  Research & Development
2   37       Yes      Travel_Rarely       1373  Research & Development
3   33        No  Travel_Frequently       1392  Research & Development
4   27        No      Travel_Rarely        591  Research & Development

   DistanceFromHome  Education EducationField  EmployeeCount  EmployeeNumber  \
0                 1          2  Life Sciences              1               1
1                 8          1  Life Sciences              1               2
2                 2          2          Other              1               4
3                 3          4  Life Sciences              1               5
4                 2          1        Medical              1               7

   ...  RelationshipSatisfaction StandardHours  StockOptionLevel  \
0  ...                         1            80                 0
1  ...                         4            80                 1
2  ...                         2            80                 0
3  ...                         3            80                 0
4  ...                         4            80                 1

   TotalWorkingYears  TrainingTimesLastYear WorkLifeBalance  YearsAtCompany  \
0                  8                      0               1               6
1                 10                      3               3              10
2                  7                      3               3               0
3                  8                      3               3               8
4                  6                      3               3               2

  YearsInCurrentRole  YearsSinceLastPromotion  YearsWithCurrManager
0                  4                        0                     5
1                  7                        1                     7
2                  0                        0                     0
3                  7                        3                     0
4                  2                        2                     2

[5 rows x 35 columns]

In [16]:
# gathering knowledge about out data and dataset
print("data frame INFORMATION ______________________")
print(df.info())
print("data frame DESCRIPTION ______________________")
print(df.describe())
print("data frame CLOUMN NULL CONTENT ______________")
print(df.isnull().sum())

data frame INFORMATION ______________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB
None
data frame DESCRIPTION ______________________
               Age    DailyRate  DistanceFromHome    Education  EmployeeCount  \
count  1470.000000  1470.000000       1470.000000  1470.000000         1470.0
mean     36.923810   802.485714          9.192517     2.912925            1.0
std       9.135373   403.509100          8.106864     1.024165            0.0
min      18.000000   102.000000          1.000000     1.000000            1.0
25%      30.000000   465.000000          2.000000     2.000000            1.0
50%      36.000000   802.000000          7.000000     3.000000            1.0
75%      43.000000  1157.000000         14.000000     4.000000            1.0
max      60.000000  1499.000000         29.000000     5.000000            1.0

       EmployeeNumber  EnvironmentSatisfaction   HourlyRate  JobInvolvement  \
count     1470.000000              1470.000000  1470.000000     1470.000000
mean      1024.865306                 2.721769    65.891156        2.729932
std        602.024335                 1.093082    20.329428        0.711561
min          1.000000                 1.000000    30.000000        1.000000
25%        491.250000                 2.000000    48.000000        2.000000
50%       1020.500000                 3.000000    66.000000        3.000000
75%       1555.750000                 4.000000    83.750000        3.000000
max       2068.000000                 4.000000   100.000000        4.000000

          JobLevel  ...  RelationshipSatisfaction  StandardHours  \
count  1470.000000  ...               1470.000000         1470.0
mean      2.063946  ...                  2.712245           80.0
std       1.106940  ...                  1.081209            0.0
min       1.000000  ...                  1.000000           80.0
25%       1.000000  ...                  2.000000           80.0
50%       2.000000  ...                  3.000000           80.0
75%       3.000000  ...                  4.000000           80.0
max       5.000000  ...                  4.000000           80.0

       StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
count       1470.000000        1470.000000            1470.000000
mean           0.793878          11.279592               2.799320
std            0.852077           7.780782               1.289271
min            0.000000           0.000000               0.000000
25%            0.000000           6.000000               2.000000
50%            1.000000          10.000000               3.000000
75%            1.000000          15.000000               3.000000
max            3.000000          40.000000               6.000000

       WorkLifeBalance  YearsAtCompany  YearsInCurrentRole  \
count      1470.000000     1470.000000         1470.000000
mean          2.761224        7.008163            4.229252
std           0.706476        6.126525            3.623137
min           1.000000        0.000000            0.000000
25%           2.000000        3.000000            2.000000
50%           3.000000        5.000000            3.000000
75%           3.000000        9.000000            7.000000
max           4.000000       40.000000           18.000000

       YearsSinceLastPromotion  YearsWithCurrManager
count              1470.000000           1470.000000
mean                  2.187755              4.123129
std                   3.222430              3.568136
min                   0.000000              0.000000
25%                   0.000000              2.000000
50%                   1.000000              3.000000
75%                   3.000000              7.000000
max                  15.000000             17.000000

[8 rows x 26 columns]
data frame CLOUMN NULL CONTENT ______________
Age                         0
Attrition                   0
BusinessTravel              0
DailyRate                   0
Department                  0
DistanceFromHome            0
Education                   0
EducationField              0
EmployeeCount               0
EmployeeNumber              0
EnvironmentSatisfaction     0
Gender                      0
HourlyRate                  0
JobInvolvement              0
JobLevel                    0
JobRole                     0
JobSatisfaction             0
MaritalStatus               0
MonthlyIncome               0
MonthlyRate                 0
NumCompaniesWorked          0
Over18                      0
OverTime                    0
PercentSalaryHike           0
PerformanceRating           0
RelationshipSatisfaction    0
StandardHours               0
StockOptionLevel            0
TotalWorkingYears           0
TrainingTimesLastYear       0
WorkLifeBalance             0
YearsAtCompany              0
YearsInCurrentRole          0
YearsSinceLastPromotion     0
YearsWithCurrManager        0
dtype: int64

In [20]:
print(df["EmployeeNumber"].duplicated().sum())

0

In [24]:
print(data["id"].duplicated().sum())

0

In [4]:
import pandas as pd
df = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/WA_Fn-UseC_-HR-Employee-Attrition.csv")
print(df.drop_duplicates("EmployeeNumber"))

      Age Attrition     BusinessTravel  DailyRate              Department  \
0      41       Yes      Travel_Rarely       1102                   Sales
1      49        No  Travel_Frequently        279  Research & Development
2      37       Yes      Travel_Rarely       1373  Research & Development
3      33        No  Travel_Frequently       1392  Research & Development
4      27        No      Travel_Rarely        591  Research & Development
...   ...       ...                ...        ...                     ...
1465   36        No  Travel_Frequently        884  Research & Development
1466   39        No      Travel_Rarely        613  Research & Development
1467   27        No      Travel_Rarely        155  Research & Development
1468   49        No  Travel_Frequently       1023                   Sales
1469   34        No      Travel_Rarely        628  Research & Development

      DistanceFromHome  Education EducationField  EmployeeCount  \
0                    1          2  Life Sciences              1
1                    8          1  Life Sciences              1
2                    2          2          Other              1
3                    3          4  Life Sciences              1
4                    2          1        Medical              1
...                ...        ...            ...            ...
1465                23          2        Medical              1
1466                 6          1        Medical              1
1467                 4          3  Life Sciences              1
1468                 2          3        Medical              1
1469                 8          3        Medical              1

      EmployeeNumber  ...  RelationshipSatisfaction StandardHours  \
0                  1  ...                         1            80
1                  2  ...                         4            80
2                  4  ...                         2            80
3                  5  ...                         3            80
4                  7  ...                         4            80
...              ...  ...                       ...           ...
1465            2061  ...                         3            80
1466            2062  ...                         1            80
1467            2064  ...                         2            80
1468            2065  ...                         4            80
1469            2068  ...                         1            80

      StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
0                    0                  8                      0
1                    1                 10                      3
2                    0                  7                      3
3                    0                  8                      3
4                    1                  6                      3
...                ...                ...                    ...
1465                 1                 17                      3
1466                 1                  9                      5
1467                 1                  6                      0
1468                 0                 17                      3
1469                 0                  6                      3

     WorkLifeBalance  YearsAtCompany YearsInCurrentRole  \
0                  1               6                  4
1                  3              10                  7
2                  3               0                  0
3                  3               8                  7
4                  3               2                  2
...              ...             ...                ...
1465               3               5                  2
1466               3               7                  7
1467               3               6                  2
1468               2               9                  6
1469               4               4                  3

      YearsSinceLastPromotion  YearsWithCurrManager
0                           0                     5
1                           1                     7
2                           0                     0
3                           3                     0
4                           2                     2
...                       ...                   ...
1465                        0                     3
1466                        1                     7
1467                        0                     3
1468                        0                     8
1469                        1                     2

[1470 rows x 35 columns]

In [1]:
# print(df.isnull().sum())
# print(df.dropna())
import numpy as np
# print(df.replace(np.nan, somevalues))
# df["salary"] = data["salary"].replace(np.nan, 30000)
# print(data)

In [2]:
import pandas as pd
df = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/WA_Fn-UseC_-HR-Employee-Attrition.csv")

In [4]:
print(df.isnull().sum())

Age                         0
Attrition                   0
BusinessTravel              0
DailyRate                   0
Department                  0
DistanceFromHome            0
Education                   0
EducationField              0
EmployeeCount               0
EmployeeNumber              0
EnvironmentSatisfaction     0
Gender                      0
HourlyRate                  0
JobInvolvement              0
JobLevel                    0
JobRole                     0
JobSatisfaction             0
MaritalStatus               0
MonthlyIncome               0
MonthlyRate                 0
NumCompaniesWorked          0
Over18                      0
OverTime                    0
PercentSalaryHike           0
PerformanceRating           0
RelationshipSatisfaction    0
StandardHours               0
StockOptionLevel            0
TotalWorkingYears           0
TrainingTimesLastYear       0
WorkLifeBalance             0
YearsAtCompany              0
YearsInCurrentRole          0
YearsSinceLastPromotion     0
YearsWithCurrManager        0
dtype: int64

In [3]:
# to eleminate the null value we can't use directly print(df.dropna()) as 
# it affect the total count of employees that are working in the company 
# it delete the row wise data and affect the total count of data (as dropna() delete null valued whole row)
# try to do df.replace()
# df["salary"] = df["salary"].replace(np.nan, 30000)
# print(df)
# generally nan value is replaced with mean value of that column for ex
meanSalary = df["MonthlyIncome"].mean()
print(meanSalary)
# then use the mena salary to replace nan salaries
print(df["MonthlyIncome"])
# or you can fill nan value to backward it's below value (when you have string name, male, position) like value
# print(df.fillna(method="bfill"))
# print(df.fillna(method="ffill"))

6502.931292517007
0       5993
1       5130
2       2090
3       2909
4       3468
        ...
1465    2571
1466    9991
1467    6142
1468    5390
1469    4404
Name: MonthlyIncome, Length: 1470, dtype: int64

In [22]:
import pandas as pd
# column transformations
print(df["PercentSalaryHike"].median())
print(df["PercentSalaryHike"].mean())

df.loc[(df["PercentSalaryHike"] >= 14), "SalaryHike"] = "more salary hike"
df.loc[(df["PercentSalaryHike"] < 14), "SalaryHike"] = "less salary hike"
print(df["SalaryHike"].head(5))

14.0
15.209523809523809
0    less salary hike
1    more salary hike
2    more salary hike
3    less salary hike
4    less salary hike
Name: SalaryHike, dtype: object

In [28]:
# making one col out of 2 col as full name <-- firstName + lastName
data = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/customers.csv")
# fullAddress <-- city + state
data["Full Address"] = data["city"] +", "+ data["state"]
print(data["Full Address"].head())
print(data.info())

0         Henderson, Kentucky
1     Los Angeles, California
2    Fort Lauderdale, Florida
3     Los Angeles, California
4     Concord, North Carolina
Name: Full Address, dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 793 entries, 0 to 792
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            793 non-null    object
 1   name          793 non-null    object
 2   segment       793 non-null    object
 3   state         793 non-null    object
 4   city          793 non-null    object
 5   Full Address  793 non-null    object
dtypes: object(6)
memory usage: 37.3+ KB
None

In [33]:
# finding how much a emp. get bonus by 10%
print(df["MonthlyIncome"].head())
df["Bonus"] = (df["MonthlyIncome"]/100)*20
print(df["Bonus"].head())

0    5993
1    5130
2    2090
3    2909
4    3468
Name: MonthlyIncome, dtype: int64
0    1198.6
1    1026.0
2     418.0
3     581.8
4     693.6
Name: Bonus, dtype: float64

In [36]:
data = {"Months":["January", "February","March","April"]}
a = pd.DataFrame(data)
print(a)

def extract(value):
    return value[0:3]

a["Short_months"] = a["Months"].map(extract)
print(a)

     Months
0   January
1  February
2     March
3     April
     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

In [52]:
# Group By in pandas
# when we want to summarise the data
df = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/WA_Fn-UseC_-HR-Employee-Attrition.csv")
gp = df.groupby(["Department", "Gender"]).agg({"EmployeeNumber":"count"})
print(gp)

gp = df.groupby(["JobRole", "Gender"]).agg({"EmployeeNumber":"count"})
print(gp)

                               EmployeeNumber
Department             Gender
Human Resources        Female              20
                       Male                43
Research & Development Female             379
                       Male               582
Sales                  Female             189
                       Male               257
                                  EmployeeNumber
JobRole                   Gender
Healthcare Representative Female              51
                          Male                80
Human Resources           Female              16
                          Male                36
Laboratory Technician     Female              85
                          Male               174
Manager                   Female              47
                          Male                55
Manufacturing Director    Female              72
                          Male                73
Research Director         Female              33
                          Male                47
Research Scientist        Female             114
                          Male               178
Sales Executive           Female             132
                          Male               194
Sales Representative      Female              38
                          Male                45

In [50]:
gp1 = df.groupby(["JobRole", "Gender"]).agg({"Age":"mean"})
print(gp1)

                                        Age
JobRole                   Gender
Healthcare Representative Female  38.901961
                          Male    40.387500
Human Resources           Female  34.437500
                          Male    35.972222
Laboratory Technician     Female  35.270588
                          Male    33.522989
Manager                   Female  47.680851
                          Male    45.981818
Manufacturing Director    Female  38.638889
                          Male    37.958904
Research Director         Female  41.909091
                          Male    45.468085
Research Scientist        Female  33.991228
                          Male    34.393258
Sales Executive           Female  37.833333
                          Male    36.247423
Sales Representative      Female  30.052632
                          Male    30.622222

In [57]:
gp1 = df.groupby(["Department", "Gender"]).agg({"MonthlyIncome":"mean", "Age":"min"})
print(gp1)

                               MonthlyIncome  Age
Department             Gender
Human Resources        Female    7264.000000   25
                       Male      6371.023256   19
Research & Development Female    6513.691293   18
                       Male      6129.888316   18
Sales                  Female    6972.126984   18
                       Male      6949.645914   18

In [8]:
import pandas as pd
df = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/WA_Fn-UseC_-HR-Employee-Attrition.csv")
data = pd.read_csv("/Users/rajan/github/shuPython/pandaLib/customers.csv")

data1 = {"Emp Id":["E01", "E02", "E03", "E04", "E05", "E06"],
         "Names":["Ram", "Shyam", "Rahul", "Vishal", "Ravi", "John"],
         "Age":[34, 56, 23, 44, 32, 36]}

data2 = {"Emp Id":["E01", "E07", "E03", "E04", "E08", "E06"],
         "Salary":[45000, 56000, 34000, 30000, 50000, 62000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1, "\n", df2)

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    John   36
   Emp Id  Salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E08   50000
5    E06   62000

In [11]:
# merge, join and concatenate
print(pd.merge(df1, df2, on="Emp Id", how="inner")) # by default how="inner" join

  Emp Id   Names  Age  Salary
0    E01     Ram   34   45000
1    E03   Rahul   23   34000
2    E04  Vishal   44   30000
3    E06    John   36   62000

In [10]:
print(pd.merge(left=df1, right=df2, on="Emp Id", how="right")) # by default how="inner" join

  Emp Id   Names   Age  Salary
0    E01     Ram  34.0   45000
1    E07     NaN   NaN   56000
2    E03   Rahul  23.0   34000
3    E04  Vishal  44.0   30000
4    E08     NaN   NaN   50000
5    E06    John  36.0   62000

In [12]:
print(pd.merge(df1, df2, on="Emp Id", how="left")) # by default how="inner" join

  Emp Id   Names  Age   Salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56      NaN
2    E03   Rahul   23  34000.0
3    E04  Vishal   44  30000.0
4    E05    Ravi   32      NaN
5    E06    John   36  62000.0

In [20]:
# print(df.join(df1, df2, on="Emp Id", how="left"))

In [21]:
data1 = {"Emp Id":["E01", "E02", "E03", "E04", "E05", "E06"],
         "Names":["Ram", "Shyam", "Rahul", "Vishal", "Ravi", "John"],
         "Age":[34, 56, 23, 44, 32, 36]}

data2 = {"Emp Id":["E07", "E08", "E09", "E010", "E011", "E012"],
         "Names":["bittu", "chintu", "pappu", "chotu", "bunty", "golu"],
         "Age":[34, 56, 23, 44, 32, 36]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [22]:
print(pd.concat([df1, df2]))

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    John   36
0    E07   bittu   34
1    E08  chintu   56
2    E09   pappu   23
3   E010   chotu   44
4   E011   bunty   32
5   E012    golu   36